texthelp = "Приветствую Вас с моем боте.\n В планах: \n Добавить строительство города \n Добавить поле боя для существ \n Добавить атаку других игроков"
textsell = "Покупкой алмазов считаются добровольные пожертвования в пользу сервера, " \
           "направленные на покрытие расходов проекта на различные нужды: оплата хостинга, " \
           "серверов, доменных имен, рекламных услуг и так далее. " \
           "Пожертвования не подлежат вовзрату ни при каких обстоятельствах.\n" \
           "Сколько вы хотите купить? (1 💎 = 10 руб)\n"
text_help = "Раздел помощи. Если у вас есть вопросы, предложения по игре - сообщите в раздел '⚙ Настройки -> Обратная связь. "
